Revit 2027 API
CircuitLoadCalculationMethod Enumeration
 Methods to calculate circuit loads
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum CircuitLoadCalculationMethod
Public Enumeration CircuitLoadCalculationMethod
public enum class CircuitLoadCalculationMethod
type CircuitLoadCalculationMethod
Members
Member name | Value | Description
SumApparentLoad | 1 |  Sum apparent power.
SumTrueLoadAndReactiveLoad | 0 |  Sum true power and reactive power.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace